states = {
 '1': 'Астраханская Область',
 '2': 'Краснадарская Область',
 '3': 'Москвоская Область',
 '4': 'Харабалинская Область',
 '5': 'Володарская Область'
 }
cities = {
 'Астраханская Область': 'Астрахань',
 'Краснадарская Область': 'Краснадар',
 'Москвоская Область': 'Москва',
 'Харабалинская Область': 'Харабали',
 'Володарская Область': 'Володар'
 }
print ( '-' * 50)

for abbrev, city in cities.items():
     print(f"B {abbrev} есть город {city}")
print('-' * 50)
state = states.get('Бахытжанск')
if not state:
      print("npoшу прощения, Бахытжанская область засекречена.")